"""
2차원 배열 돌리기
[90도 회전]
1 2 3        (0,0)  (0,1)  (0,2)     =>  (2,0)   (1,0)   (0,0)
4 5 6        (1,0)  (1,1)  (1,2)         (2,1)   (1,1)   (0,1)
7 8 9        (2,0)  (2,1)  (2,2)         (2,2)   (1,2)   (0,2)

x,y    x,y
0,0 -> 2,0
1,0 -> 2,1            (1) 열(y) = x
2,0 -> 2,2            (2) 행(x) = 2 - b인데, 전체길이-1-y 인듯.

[180도 회전]
90도 회전 2번 실행
"""


def rotate_90(n):
    board = [[0] * n for i in range(n)]
    for y in range(n):
        for x in range(n):
            board[x][n-1-y] = arr[y][x]
    return board


if __name__ == '__main__':
    n = 3
    arr = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
    arr = rotate_90(n)
    print(arr)
